Repository: Sirumachinery/woocommerce-gateway-siru
Catalog: siru-mobile/languages/siru-mobile-*.po
Languages: fi

source: Canceled by user
fi: Käyttäjä keskeytti

source: Enable payments by mobile phone. A new transaction is created using Siru Mobile payment gateway where user is redirected to confirm payment. Payments are charged in users mobile phone bill. Mobile payment is only available in Finland when using mobile internet connection.
fi: Ota käyttöön mobiilimaksaminen. Maksu luodaan Siru Mobile maksurajapintaan jonne käyttäjä sen jälkeen ohjataan vahvistamaan maksu. Maksut veloitetaan käyttäjän matkapuhelinlaskulla. Mobiilimaksaminen on käytössä vain Suomalaisista mobiili-internet liittymistä.

source: Continue to payment
fi: Siirry maksamaan

source: Pay using your mobile phone.
fi: Maksa matkapuhelimellasi

source: Gateway Disabled
fi: Maksutapa ei ole käytössä

source: Siru mobile payments are not available in your store currency.
fi: Siru mobiilimaksaminen ei ole saatavilla kauppasi valuutalle.

source: New Siru Mobile transaction %s
fi: Uusi Siru Mobile maksutapahtuma %s

source: Enable SiruMobile Payment
fi: Ota käyttöön Siru mobiilimaksaminen

source: Title
fi: Otsikko

source: Description
fi: Kuvaus

source: Sandbox
fi: Hiekkalaatikko

source: Use Siru Mobile sandbox environment.
fi: Käytä Siru Mobilen testiympäristöä

source: Sandbox environment is for testing mobile payments without actually charging the user. Remember that you may need separate credentials for sandbox and production endpoints.
fi: Testiympäristö eli hiekkalaatikko on tarkoitettu maksujen testaamiseen ilman että käyttäjää veloitetaan. Muista että saatat tarvita erilliset tunnukset kun siirryt käyttämään tuotantoympäristöä.

source: Log payment events to <code>%s</code>.
fi: Tallenna maksutapahtumat ja virheet lokiin <code>%s</code>.

source: Merchant Id
fi: Kauppiastunnus

source: REQUIRED: Your merchantId provided by Siru Mobile
fi: PAKOLLINEN: Anna kauppiastunnus jonka olet saanut Siru Mobilelta

source: Merchant secret
fi: Kauppiasavain

source: REQUIRED: Your merchant secret provided by Siru Mobile
fi: PAKOLLINEN: Anna kauppiasavain jonka olet saanut Siru Mobilelta

source: Sub-merchant reference
fi: Jälleenmyyjän tunniste

source: Optional store identifier if you have more than one store using the same merchantId.
fi: Jos käytät samaa kauppiastunnusta useassa verkkokaupassa, voit eritellä maksut antamalla joka kaupalle oman tunnisteen.

source: Purchase country
fi: Maa

source: Tax class
fi: Veroluokka

source: The VAT class sent to mobile operator. You can only select one tax class for mobile payments. Tax class 3 is the general rate, classes 1 and 2 are reduced rates. For more information, please see Siru Mobile API documentation.
fi: Operaattorille ilmoitettava veroluokka. Voit käyttää vain yhtä veroluokkaa mobiilimaksuissa. Veroluokka 3 on yleinen verokanta. Luokat 1 ja 2 ovat alennettuja verokantoja. Lisätietoja saat Siru Mobile API dokumentaatiosta.

source: no tax
fi: veroton

source: tax class 1
fi: Veroluokka 1

source: tax class 2
fi: Veroluokka 2

source: tax class 3
fi: Veroluokka 3

source: Service group
fi: Palveluluokka

source: The Finnish Communications Regulatory Authority requires paid phone services to be categorized into service groups. A customer's phone subscription may bar calls to certain service groups.
fi: Maksulliset palvelut jaetaan palveluiden sisällön perusteella Viestintäviraston määräämiin palveluluokkiin. Loppukäyttäjä on voinut sopia tiettyjen palveluluokkien estosta operaattorinsa kanssa.

source: Non-profit services
fi: Yleishyödylliset palvelut

source: Online services
fi: Asiointipalvelut

source: Entertainment services
fi: Ajanvietepalvelut

source: Adult entertainment services
fi: Aikuisviihdepalvelut

source: Instant payment
fi: Nopea maksaminen

source: Use fast checkout process
fi: Käytä nopeaa maksuprosessia (suositus)

source: Maximum payment allowed
fi: Suurin sallittu maksu

source: Maximum payment amount available for mobile payments.
fi: Suurin sallittu summa mobiilimaksuille. Mikäli ostoskorin arvo ylittää tämän summan, mobiilimaksaminen ei ole käytettävissä.

source: Settings
fi: Asetukset
